app/views/notification/task_incomplete.html.erb

UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_completed", "f"], ["updated_at", "2015-10-31 11:51:47.419002"], ["id", 306]]
---
<p>Dear <%= @task.project.client.name %></p>
 <p>Task (<%= @task.name %>) has been re opened on <%= @task.updated_at.strftime("%A, %d %B %Y") %> at <%= @task.updated_at.strftime("%H:%M %p")%> which belongs to <%= @task.project.name %></p>