app/views/notification/task_completed.html.erb

<p>Dear <%= @task.project.client.name %></p>
 <p>Task (<%= @task.name %>) has been completed on <%= @task.updated_at.strftime("%A, %d %B %Y") %> at <%= @task.updated_at.strftime("%H:%M %p")%> which belongs to <%= @task.project.name %></p>
---
UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_completed", "t"], ["updated_at", "2015-10-31 11:03:26.756917"], ["id", 9]]