app/views/say/hello.html.erb

      <td><%= project.status %></td>
      <td><%= project.tasks.size %></td>
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ? AND (is_completed = 'f')  [["project_id", 39]]