app/views/clients/show.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 4]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 4]]
---

<h3>Projects (* <%= @client.projects.size %> *) </h3>