app/views/projects/edit.html.erb

SELECT "clients".* FROM "clients"
---
<label>Client</label><br/>
<%= f.collection_select :client_id, Client.all, :id, :name, prompt: "Select Client" %><br/>