app/views/projects/index.xls.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 10]]
---
			<td><%= project.client.try(:name)%></td>
			<td><%= project.tasks.size %></td>