app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND (is_completed = 'f' AND due_date >= '2015-10-11')  [["project_id", 13]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 13]]
---

<h3>Total Tasks <%= @project.tasks.size %></h3>