app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    @category.user_id = current_user.id
    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Web Developement"], ["user_id", 1], ["created_at", "2015-10-10 12:41:11.311179"], ["updated_at", "2015-10-10 12:41:11.311179"]]

  def edit
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 26]]

  def update
    @category = Category.find(params[:id])
    respond_to do |format|
      if @category.update_attributes(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 26]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Manual Testing"], ["updated_at", "2015-10-10 14:06:01.724924"], ["id", 26]]

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 6]]