app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)
    @client.user_id = current_user.id
    if @client.save
---
INSERT INTO "clients" ("name", "company", "email", "website", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    begin
      @client = current_user.clients.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? AND "clients"."id" = ? LIMIT 1  [["user_id", 1], ["id", 18]]

  def edit
    begin
      @client = current_user.clients.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? AND "clients"."id" = ? LIMIT 1  [["user_id", 2], ["id", 18]]

  def update
    @client = Client.find(params[:id])
    if @client.update_attributes(client_params)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "clients" SET "name" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "Trevor Bartell Jr"], ["updated_at", "2015-09-27 09:18:48.170559"], ["id", 4]]

  def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 4]]