app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.user_id = current_user.id
    if @project.save
---
INSERT INTO "projects" ("name", "client_id", "description", "status", "start_date", "user_id", "created_at", "updated_at", "project_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    begin
      @project = current_user.projects.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT 1  [["user_id", 3], ["id", 58]]

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 57]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "both the autralian and india website"], ["updated_at", "2015-09-27 11:24:47.713508"], ["id", 57]]

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 57]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 57]]

  def show
    begin
      @project = current_user.projects.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT 1  [["user_id", 1], ["id", 13]]