app/controllers/say_controller.rb

  def hello
    @client = Client.first
    @clients = Client.all
    @projects = Project.where('start_date')
---
SELECT  "clients".* FROM "clients"  ORDER BY "clients"."id" ASC LIMIT 1
SELECT "projects".* FROM "projects" WHERE (start_date)