app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "project_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["project_id", 13], ["due_date", "2015-10-11"], ["created_at", "2015-10-11 07:22:49.735162"], ["updated_at", "2015-10-11 07:22:49.735162"]]
---
  def create
    @task = Task.new(params_task)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_completed", "t"], ["updated_at", "2015-10-31 10:00:52.713833"], ["id", 9]]
---
  def mark_as_complete
    @task = Task.find(params[:task_id])
    @task.update_attributes(is_completed: true)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_completed", "f"], ["updated_at", "2015-10-31 10:03:39.030549"], ["id", 9]]
---
  def mark_as_incomplete
    @task = Task.find(params[:task_id])
    @task.update_attributes(is_completed: false)