app/views/categories/destroy.js.erb

$('#li_<%= @category.id%>').slideUp();
$('#count').html('<%= current_user.categories.size %>');
---
SELECT COUNT(*) FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]